Vulnerability Test Results/artillery-load-test.yml
config:
  target: "https://aavis.vercel.app"
  phases:
    - duration: 20
      arrivalRate: 5
      rampTo: 20
      name: Ramp up phase
    - duration: 40
      arrivalRate: 20
      name: Sustained load phase
  defaults:
    headers:
      Content-Type: "application/json"

scenarios:
  - name: "Health check baseline scenario"
    flow:
      - get:
          url: "/"
